# Importing the essential library and reading the csv file

In [1]:
import pandas as pd 

df = pd.read_csv('Placement_Data_Full_Class.csv')
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

# checking the null values

In [2]:
df.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

# replacing all the null values 0 (since all the null values belongs to salary columns)

In [3]:
df = df.fillna(0.0)

# Exploring the dataset

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          215 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [5]:
df.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,198702.325581
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,154780.926716
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,0.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,0.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,240000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,282500.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [6]:
#finding the outlier

In [7]:
df = df[df['salary']<=df['salary'].quantile(0.99)]

In [8]:
df.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,212.000000,212.000000,212.000000,212.000000,212.000000,212.000000,212.000000
mean,107.410377,67.289764,66.214953,66.358443,72.046981,62.232830,190759.433962
std,62.385945,10.884665,10.755172,7.336076,13.253058,5.842984,139716.821446
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,0.000000
25%,53.750000,60.357500,60.950000,61.000000,60.000000,57.875000,0.000000
50%,106.500000,67.000000,65.000000,66.000000,70.500000,61.950000,240000.000000
75%,161.250000,76.000000,73.000000,72.000000,83.250000,66.242500,278500.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,500000.000000

# pre-processing the salary column

In [9]:
sal = []
for i in df['salary']:
    sal.append(int(i))
    
df['salary'] = sal
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,0
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000

In [10]:
df[df['degree_p'] > 85.0]

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
197,198,F,83.96,Others,53.0,Others,Science,91.0,Sci&Tech,No,59.32,Mkt&HR,69.71,Placed,260000

### which factor influenced a candidate in getting placed
#### 1) Does percentage matters for one to get placed

In [11]:
min(df['degree_p'])

50.0

In [12]:
# degree percentage 
for i in df.values:
    if i[7] in range(50,61) and i[13] == 'Placed':
        print('Sr.no.',i[0],'got',i[7],'% in degree and got',i[13],'with salary',i[14])
        
## This shows that marks does not matter for one to get placed with minimum marks obtained is 50 percentage

Sr.no. 1 got 58.0 % in degree and got Placed with salary 270000
Sr.no. 11 got 60.0 % in degree and got Placed with salary 260000
Sr.no. 14 got 59.0 % in degree and got Placed with salary 218000
Sr.no. 48 got 57.0 % in degree and got Placed with salary 204000
Sr.no. 140 got 59.0 % in degree and got Placed with salary 220000
Sr.no. 149 got 56.0 % in degree and got Placed with salary 240000
Sr.no. 155 got 60.0 % in degree and got Placed with salary 250000
Sr.no. 167 got 60.0 % in degree and got Placed with salary 240000
Sr.no. 173 got 56.0 % in degree and got Placed with salary 300000
Sr.no. 177 got 56.0 % in degree and got Placed with salary 220000
Sr.no. 194 got 56.0 % in degree and got Placed with salary 300000
Sr.no. 200 got 57.0 % in degree and got Placed with salary 265000
Sr.no. 214 got 58.0 % in degree and got Placed with salary 204000

#### 2) Which degree specialisation is much demanded by corporate

In [13]:
dct = {}
for i in df.values:
    if (i[11]) in dct:
        dct[i[11]] += 1
    else:
        dct[i[11]] = 1
        
        
print('Most demanded specialisation degree by corporate is:',list(dct.keys())[list(dct.values()).index(max(dct.values()))])


## hence this proves that there is a lot of demanding specialisation degree demand in the field of market and finance

Most demanded specialisation degree by corporate is: Mkt&Fin

#### 3) Play with the data conducting all statistical test

##### 3.1) playing around with ssc_p
######  # defining a mean function

In [14]:
def mean(col):
    tot    = 0
    tot_p  = 0
    for i in df[col]:
        tot += 1
        tot_p += i
    mean_ = round(tot_p/tot,2)
    return mean_,tot

mean_,tot = mean('ssc_p')
print('Average percentage scored :',mean_)

Average percentage scored : 67.29

##### # Defining the median function

In [15]:
def median(col,n):
    if n % 2 != 0:
        median = df[col][(n+1)//2]
    else:
        median = round((df[col][n/2]+df[col][(n/2)+1])/2,2)
        
    return median

print('Median is :',median('ssc_p',tot))

Median is : 71.54

##### # Defining the mode function

In [16]:
def mode(col):
    mode_ = {}
    for i in df[col]:
        if i not in mode_:
            mode_[i] = 1
        else:
            mode_[i] += 1

    return list(mode_.keys())[list(mode_.values()).index(max(mode_.values()))]

print('Mode is :',mode('ssc_p'))

Mode is : 62.0

##### # Defining the  Mean Absolute deviation function

In [28]:
for i in df['ssc_p']:
    print(i)

67.0
79.33
65.0
56.0
85.8
55.0
46.0
82.0
73.0
58.0
58.0
69.6
47.0
77.0
62.0
65.0
63.0
55.0
63.0
60.0
62.0
79.0
69.8
77.4
76.5
52.58
71.0
63.0
76.76
62.0
64.0
67.0
61.0
87.0
62.0
69.0
51.0
79.0
73.0
81.0
78.0
74.0
49.0
87.0
77.0
76.0
70.89
63.0
63.0
50.0
75.2
54.4
40.89
80.0
74.0
60.4
63.0
68.0
74.0
52.6
74.0
84.2
86.5
61.0
80.0
54.0
83.0
80.92
69.7
73.0
82.0
75.0
84.86
64.6
56.6
59.0
66.5
64.0
84.0
69.0
69.0
81.7
63.0
84.0
70.0
83.84
62.0
59.6
66.0
84.0
85.0
52.0
60.23
52.0
58.0
73.0
76.0
70.5
69.0
54.0
45.0
63.0
77.0
73.0
69.0
59.0
61.08
82.0
61.0
52.0
69.5
51.0
58.0
73.96
65.0
73.0
68.2
77.0
76.0
58.0
64.0
66.5
74.0
67.0
84.0
79.0
72.0
80.4
76.7
62.0
74.9
67.0
73.0
77.44
72.0
47.0
67.0
82.0
77.0
65.0
66.0
85.0
77.67
52.0
89.4
62.0
70.0
77.0
44.0
65.0
75.4
49.0
53.0
51.57
84.2
66.5
67.0
52.0
87.0
55.6
74.2
63.0
67.16
63.3
62.0
67.9
48.0
59.96
63.4
80.0
73.0
52.0
73.24
63.0
59.0
68.0
77.8
65.0
62.0
52.0
65.0
56.28
88.0
52.0
78.5
61.8
54.0
64.0
67.0
65.2
60.0
52.0
66.0
72.0
83.96
67.0
69.0
69.0
54.2
70.0
55.68
74.0
61.0
41.0
83.33
43.0
62.0
80.6
58.0
67.0
74.0
62.0

##### # Defining the  standard deviation function

In [17]:
def std_d(col,avg_val):
    ls = []
    for i in df[col]:
        ls.append(round(abs(i - avg_val)**2,2))

    sd = (sum(ls)/len(ls))**0.5
    return sd

###### 3.1.1) finding the percentile (SSC_P)

In [21]:
print('minimum/0 percentile   : ',round(df.ssc_p.quantile(0),2))            # 0 percentile/minimum
print('25th percentile        : ',round(df.ssc_p.quantile(0.25),2))         # 25 percentile
print('75th percentile        : ',round(df.ssc_p.quantile(0.75),2))         # 75 percentile
print('maximum/100 percentile : ',round(df.ssc_p.quantile(1),2))            # 100 percentile
print('standard deviation     : ',round(std_d('ssc_p',mean_),2))            # standard deviation

minimum/0 percentile   :  40.89
25th percentile        :  60.36
75th percentile        :  76.0
maximum/100 percentile :  89.4
standard deviation     :  10.86

##### 3.2) playing around with hsc_p

In [23]:
m,tot = mean('hsc_p')
print('Average percentage scored :',m)                                          # 50 percentile/mean
print('Median is                 :',median('hsc_p',tot))                        # middle value
print('Mode is                   :',mode('hsc_p'))                              # Most frequent 
print('minimum/0 percentile      :',round(df.hsc_p.quantile(0),2))              # 0 percentile/minimum
print('25th percentile           :',round(df.hsc_p.quantile(0.25),2))           # 25 percentile
print('75th percentile           :',round(df.hsc_p.quantile(0.75),2))           # 75 percentile
print('maximum/100 percentile    :',round(df.hsc_p.quantile(1),2))              # 100 percentile
print('standard deviation        :',round(std_d('hsc_p',m),2))                  # standard deviation

Average percentage scored : 66.21
Median is                 : 70.0
Mode is                   : 63.0
minimum/0 percentile      : 37.0
25th percentile           : 60.95
75th percentile           : 73.0
maximum/100 percentile    : 97.7
standard deviation        : 10.73

##### 3.3) playing around with degree_p

In [24]:
me,tot = mean('degree_p')
print('Average percentage scored in a degree :',me)                                   # 50 percentile/mean
print('Median is                             :',median('degree_p',tot))               # middle value
print('Mode is                               :',mode('degree_p'))                     # Most frequent 
print('minimum/0 percentile                  :',round(df.degree_p.quantile(0),2))     # 0 percentile/minimum
print('25th percentile                       :',round(df.degree_p.quantile(0.25),2))  # 25 percentile
print('75th percentile                       :',round(df.degree_p.quantile(0.75),2))  # 75 percentile
print('maximum/100 percentile                :',round(df.degree_p.quantile(1),2))     # 100 percentile
print('standard deviation                    :',round(std_d('degree_p',me),2))        # standard deviation

Average percentage scored in a degree : 66.36
Median is                             : 68.5
Mode is                               : 65.0
minimum/0 percentile                  : 50.0
25th percentile                       : 61.0
75th percentile                       : 72.0
maximum/100 percentile                : 91.0
standard deviation                    : 7.32

##### 3.4) playing around with etest_p

In [25]:
mea,tot = mean('etest_p')
print('Average percentage scored :',mea)                                    # 50 percentile/mean
print('Median is                 :',median('etest_p',tot))                  # middle value
print('Mode is                   :',mode('etest_p'))                        # Most frequent 
print('minimum/0 percentile      :',round(df.etest_p.quantile(0),2))        # 0 percentile/minimum
print('25th percentile           :',round(df.etest_p.quantile(0.25),2))     # 25 percentile
print('75th percentile           :',round(df.etest_p.quantile(0.75),2))     # 75 percentile
print('maximum/100 percentile    :',round(df.etest_p.quantile(1),2))        # 100 percentile
print('standard deviation        :',round(std_d('etest_p',mea),2))          # standard deviation

Average percentage scored : 72.05
Median is                 : 75.5
Mode is                   : 60.0
minimum/0 percentile      : 50.0
25th percentile           : 60.0
75th percentile           : 83.25
maximum/100 percentile    : 98.0
standard deviation        : 13.22

##### 3.5) playing around with mba_p

In [26]:
a,tot = mean('mba_p')
print('Average percentage scored in MBA :',a)                                  # 50 percentile/mean
print('Median is                        :',median('mba_p',tot))                # middle value
print('Mode is                          :',mode('mba_p'))                      # Most frequent 
print('minimum/0 percentile             :',round(df.mba_p.quantile(0),2))      # 0 percentile/minimum
print('25th percentile                  :',round(df.mba_p.quantile(0.25),2))   # 25 percentile
print('75th percentile                  :',round(df.mba_p.quantile(0.75),2))   # 75 percentile
print('maximum/100 percentile           :',round(df.mba_p.quantile(1),2))      # 100 percentile
print('standard deviation               :',round(std_d('mba_p',a),2))          # standard deviation

Average percentage scored in MBA :  62.23
Median is                        :  69.6
Mode is                          :  56.7
minimum/0 percentile             :  51.21
25th percentile                  :  57.88
75th percentile                  :  66.24
maximum/100 percentile           :  77.89
standard deviation               :  5.83

##### 3.6) playing around with salary

In [27]:
avg,tot = mean('salary')
print('Average salary         :',avg)                                  # 50 percentile/mean
print('Median is              :',median('salary',tot))                 # middle value
print('Mode is                :',mode('salary'))                       # Most frequent 
print('minimum/0 percentile   :',round(df.salary.quantile(0),2))       # 0 percentile/minimum
print('25th percentile        :',round(df.salary.quantile(0.25),2))    # 25 percentile
print('75th percentile        :',round(df.salary.quantile(0.75),2))    # 75 percentile
print('maximum/100 percentile :',round(df.salary.quantile(1),2))       # 100 percentile
print('standard deviation     :',round(std_d('salary',avg),2))         # standard deviation

Average salary         :  190759.43
Median is              :  100000.0
Mode is                :  0
minimum/0 percentile   :  0.0
25th percentile        :  0.0
75th percentile        :  278500.0
maximum/100 percentile :  500000.0
standard deviation     :  139386.91